{
  "ir_version": 7,
  "opset_version": 14,
  "producer": "pytorch",
  "model_version": 0,
  "inputs": [
    {
      "name": "mel_spectrogram",
      "dtype": "FLOAT",
      "shape": [
        "batch",
        1,
        40,
        "time_frames"
      ]
    }
  ],
  "outputs": [
    {
      "name": "logit",
      "dtype": "FLOAT",
      "shape": [
        "batch"
      ]
    }
  ],
  "nodes": [
    {
      "op_type": "Conv",
      "name": "/cnn/cnn.0/Conv",
      "inputs": [
        "mel_spectrogram",
        "onnx::Conv_144",
        "onnx::Conv_145"
      ],
      "outputs": [
        "/cnn/cnn.0/Conv_output_0"
      ],
      "attributes": {
        "dilations": [
          1,
          1
        ],
        "group": 1,
        "kernel_shape": [
          3,
          3
        ],
        "pads": [
          1,
          1,
          1,
          1
        ],
        "strides": [
          1,
          1
        ]
      }
    },
    {
      "op_type": "Relu",
      "name": "/cnn/cnn.2/Relu",
      "inputs": [
        "/cnn/cnn.0/Conv_output_0"
      ],
      "outputs": [
        "/cnn/cnn.2/Relu_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "MaxPool",
      "name": "/cnn/cnn.3/MaxPool",
      "inputs": [
        "/cnn/cnn.2/Relu_output_0"
      ],
      "outputs": [
        "/cnn/cnn.3/MaxPool_output_0"
      ],
      "attributes": {
        "ceil_mode": 0,
        "dilations": [
          1,
          1
        ],
        "kernel_shape": [
          2,
          2
        ],
        "pads": [
          0,
          0,
          0,
          0
        ],
        "strides": [
          2,
          2
        ]
      }
    },
    {
      "op_type": "Conv",
      "name": "/cnn/cnn.4/Conv",
      "inputs": [
        "/cnn/cnn.3/MaxPool_output_0",
        "onnx::Conv_147",
        "onnx::Conv_148"
      ],
      "outputs": [
        "/cnn/cnn.4/Conv_output_0"
      ],
      "attributes": {
        "dilations": [
          1,
          1
        ],
        "group": 1,
        "kernel_shape": [
          3,
          3
        ],
        "pads": [
          1,
          1,
          1,
          1
        ],
        "strides": [
          1,
          1
        ]
      }
    },
    {
      "op_type": "Relu",
      "name": "/cnn/cnn.6/Relu",
      "inputs": [
        "/cnn/cnn.4/Conv_output_0"
      ],
      "outputs": [
        "/cnn/cnn.6/Relu_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "MaxPool",
      "name": "/cnn/cnn.7/MaxPool",
      "inputs": [
        "/cnn/cnn.6/Relu_output_0"
      ],
      "outputs": [
        "/cnn/cnn.7/MaxPool_output_0"
      ],
      "attributes": {
        "ceil_mode": 0,
        "dilations": [
          1,
          1
        ],
        "kernel_shape": [
          2,
          2
        ],
        "pads": [
          0,
          0,
          0,
          0
        ],
        "strides": [
          2,
          2
        ]
      }
    },
    {
      "op_type": "Conv",
      "name": "/cnn/cnn.8/Conv",
      "inputs": [
        "/cnn/cnn.7/MaxPool_output_0",
        "onnx::Conv_150",
        "onnx::Conv_151"
      ],
      "outputs": [
        "/cnn/cnn.8/Conv_output_0"
      ],
      "attributes": {
        "dilations": [
          1,
          1
        ],
        "group": 1,
        "kernel_shape": [
          3,
          3
        ],
        "pads": [
          1,
          1,
          1,
          1
        ],
        "strides": [
          1,
          1
        ]
      }
    },
    {
      "op_type": "Relu",
      "name": "/cnn/cnn.10/Relu",
      "inputs": [
        "/cnn/cnn.8/Conv_output_0"
      ],
      "outputs": [
        "/cnn/cnn.10/Relu_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "MaxPool",
      "name": "/cnn/cnn.11/MaxPool",
      "inputs": [
        "/cnn/cnn.10/Relu_output_0"
      ],
      "outputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "attributes": {
        "ceil_mode": 0,
        "dilations": [
          1,
          1
        ],
        "kernel_shape": [
          2,
          1
        ],
        "pads": [
          0,
          0,
          0,
          0
        ],
        "strides": [
          2,
          1
        ]
      }
    },
    {
      "op_type": "Shape",
      "name": "/Shape",
      "inputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "outputs": [
        "/Shape_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/Constant",
      "inputs": [],
      "outputs": [
        "/Constant_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Gather",
      "name": "/Gather",
      "inputs": [
        "/Shape_output_0",
        "/Constant_output_0"
      ],
      "outputs": [
        "/Gather_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Shape",
      "name": "/Shape_1",
      "inputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "outputs": [
        "/Shape_1_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/Constant_1",
      "inputs": [],
      "outputs": [
        "/Constant_1_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Gather",
      "name": "/Gather_1",
      "inputs": [
        "/Shape_1_output_0",
        "/Constant_1_output_0"
      ],
      "outputs": [
        "/Gather_1_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Shape",
      "name": "/Shape_2",
      "inputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "outputs": [
        "/Shape_2_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/Constant_2",
      "inputs": [],
      "outputs": [
        "/Constant_2_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Gather",
      "name": "/Gather_2",
      "inputs": [
        "/Shape_2_output_0",
        "/Constant_2_output_0"
      ],
      "outputs": [
        "/Gather_2_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Shape",
      "name": "/Shape_3",
      "inputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "outputs": [
        "/Shape_3_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/Constant_3",
      "inputs": [],
      "outputs": [
        "/Constant_3_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Gather",
      "name": "/Gather_3",
      "inputs": [
        "/Shape_3_output_0",
        "/Constant_3_output_0"
      ],
      "outputs": [
        "/Gather_3_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Transpose",
      "name": "/Transpose",
      "inputs": [
        "/cnn/cnn.11/MaxPool_output_0"
      ],
      "outputs": [
        "/Transpose_output_0"
      ],
      "attributes": {
        "perm": [
          0,
          3,
          1,
          2
        ]
      }
    },
    {
      "op_type": "Mul",
      "name": "/Mul",
      "inputs": [
        "/Gather_1_output_0",
        "/Gather_2_output_0"
      ],
      "outputs": [
        "/Mul_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "Constant_36",
      "inputs": [],
      "outputs": [
        "onnx::Unsqueeze_55"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Unsqueeze",
      "name": "/Unsqueeze",
      "inputs": [
        "/Gather_output_0",
        "onnx::Unsqueeze_55"
      ],
      "outputs": [
        "/Unsqueeze_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "Constant_38",
      "inputs": [],
      "outputs": [
        "onnx::Unsqueeze_57"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Unsqueeze",
      "name": "/Unsqueeze_1",
      "inputs": [
        "/Gather_3_output_0",
        "onnx::Unsqueeze_57"
      ],
      "outputs": [
        "/Unsqueeze_1_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "Constant_40",
      "inputs": [],
      "outputs": [
        "onnx::Unsqueeze_59"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Unsqueeze",
      "name": "/Unsqueeze_2",
      "inputs": [
        "/Mul_output_0",
        "onnx::Unsqueeze_59"
      ],
      "outputs": [
        "/Unsqueeze_2_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Concat",
      "name": "/Concat",
      "inputs": [
        "/Unsqueeze_output_0",
        "/Unsqueeze_1_output_0",
        "/Unsqueeze_2_output_0"
      ],
      "outputs": [
        "/Concat_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Reshape",
      "name": "/Reshape",
      "inputs": [
        "/Transpose_output_0",
        "/Concat_output_0"
      ],
      "outputs": [
        "/Reshape_output_0"
      ],
      "attributes": {
        "allowzero": 0
      }
    },
    {
      "op_type": "Shape",
      "name": "/gru/Shape",
      "inputs": [
        "/Reshape_output_0"
      ],
      "outputs": [
        "/gru/Shape_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/gru/Constant",
      "inputs": [],
      "outputs": [
        "/gru/Constant_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Gather",
      "name": "/gru/Gather",
      "inputs": [
        "/gru/Shape_output_0",
        "/gru/Constant_output_0"
      ],
      "outputs": [
        "/gru/Gather_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "Constant",
      "name": "/gru/Constant_1",
      "inputs": [],
      "outputs": [
        "/gru/Constant_1_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Constant",
      "name": "Constant_48",
      "inputs": [],
      "outputs": [
        "onnx::Unsqueeze_69"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Unsqueeze",
      "name": "/gru/Unsqueeze",
      "inputs": [
        "/gru/Gather_output_0",
        "onnx::Unsqueeze_69"
      ],
      "outputs": [
        "/gru/Unsqueeze_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Constant",
      "name": "/gru/Constant_2",
      "inputs": [],
      "outputs": [
        "/gru/Constant_2_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Concat",
      "name": "/gru/Concat",
      "inputs": [
        "/gru/Constant_1_output_0",
        "/gru/Unsqueeze_output_0",
        "/gru/Constant_2_output_0"
      ],
      "outputs": [
        "/gru/Concat_output_0"
      ],
      "attributes": {
        "axis": 0
      }
    },
    {
      "op_type": "ConstantOfShape",
      "name": "/gru/ConstantOfShape",
      "inputs": [
        "/gru/Concat_output_0"
      ],
      "outputs": [
        "/gru/ConstantOfShape_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Transpose",
      "name": "/gru/Transpose",
      "inputs": [
        "/Reshape_output_0"
      ],
      "outputs": [
        "/gru/Transpose_output_0"
      ],
      "attributes": {
        "perm": [
          1,
          0,
          2
        ]
      }
    },
    {
      "op_type": "GRU",
      "name": "/gru/GRU",
      "inputs": [
        "/gru/Transpose_output_0",
        "onnx::GRU_171",
        "onnx::GRU_172",
        "onnx::GRU_173",
        "",
        "/gru/ConstantOfShape_output_0"
      ],
      "outputs": [
        "/gru/GRU_output_0",
        "/gru/GRU_output_1"
      ],
      "attributes": {
        "hidden_size": 64,
        "linear_before_reset": 1
      }
    },
    {
      "op_type": "Constant",
      "name": "/Constant_4",
      "inputs": [],
      "outputs": [
        "/Constant_4_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Squeeze",
      "name": "/Squeeze",
      "inputs": [
        "/gru/GRU_output_1",
        "/Constant_4_output_0"
      ],
      "outputs": [
        "/Squeeze_output_0"
      ],
      "attributes": {}
    },
    {
      "op_type": "Gemm",
      "name": "/head/head.1/Gemm",
      "inputs": [
        "/Squeeze_output_0",
        "head.1.weight",
        "head.1.bias"
      ],
      "outputs": [
        "/head/head.1/Gemm_output_0"
      ],
      "attributes": {
        "alpha": 1.0,
        "beta": 1.0,
        "transB": 1
      }
    },
    {
      "op_type": "Constant",
      "name": "/Constant_5",
      "inputs": [],
      "outputs": [
        "/Constant_5_output_0"
      ],
      "attributes": {
        "value": "4"
      }
    },
    {
      "op_type": "Squeeze",
      "name": "/Squeeze_1",
      "inputs": [
        "/head/head.1/Gemm_output_0",
        "/Constant_5_output_0"
      ],
      "outputs": [
        "logit"
      ],
      "attributes": {}
    }
  ],
  "weights": {
    "head.1.weight": {
      "shape": [
        1,
        64
      ],
      "dtype": "float32",
      "data": [
        0.17290334403514862,
        0.12300270050764084,
        -0.12393632531166077,
        0.02386827953159809,
        0.07410025596618652,
        0.11463252454996109,
        0.0528726652264595,
        0.16561977565288544,
        0.07592163980007172,
        0.09865346550941467,
        -0.16823363304138184,
        -0.06410929560661316,
        0.06793917715549469,
        -0.11085203289985657,
        -0.07936979085206985,
        -0.08367545157670975,
        0.10956356674432755,
        0.1413165032863617,
        -0.15060895681381226,
        0.12754622101783752,
        0.08537627011537552,
        -0.09647359699010849,
        0.12224017083644867,
        0.09132225811481476,
        0.11093342304229736,
        0.09678926318883896,
        0.03535798564553261,
        0.04174581915140152,
        -0.14444595575332642,
        0.10447568446397781,
        0.096443772315979,
        0.14818185567855835,
        -0.1296510249376297,
        0.17768922448158264,
        -0.07163179665803909,
        0.12280214577913284,
        0.1462530642747879,
        0.05837526172399521,
        -0.13091494143009186,
        0.18587440252304077,
        -0.18631328642368317,
        -0.10970338433980942,
        -0.08270498365163803,
        0.13712365925312042,
        0.13413962721824646,
        -0.040143147110939026,
        -0.051198385655879974,
        -0.15905052423477173,
        0.12116189301013947,
        0.15457749366760254,
        -0.08801800012588501,
        -0.07914816588163376,
        -0.10368793457746506,
        -0.13840033113956451,
        0.13656777143478394,
        0.18305276334285736,
        0.1109873428940773,
        0.04759528860449791,
        0.007870235480368137,
        0.10817742347717285,
        -0.09451637417078018,
        0.14605608582496643,
        0.11399298906326294,
        -0.1823422908782959
      ]
    },
    "head.1.bias": {
      "shape": [
        1
      ],
      "dtype": "float32",
      "data": [
        0.07508411258459091
      ]
    },
    "onnx::Conv_144": {
      "shape": [
        16,
        1,
        3,
        3
      ],
      "dtype": "float32",
      "data": [
        -0.5191073417663574,
        1.183319091796875,
        2.7072055339813232,
        -0.562896728515625,
        -0.021155038848519325,
        1.1627143621444702,
        -1.972962498664856,
        -2.5364632606506348,
        0.06867239624261856,
        0.44049572944641113,
        -1.0880076885223389,
        1.7079010009765625,
        0.7346215844154358,
        -0.7821441888809204,
        1.4735852479934692,
        0.5106058120727539,
        0.16793738305568695,
        0.22542336583137512,
        -1.6945973634719849,
        -0.15031947195529938,
        1.8802447319030762,
        -1.2188987731933594,
        1.2122787237167358,
        1.6346815824508667,
        2.3835091590881348,
        -1.7669388055801392,
        0.962526798248291,
        0.9281595945358276,
        -0.505351722240448,
        1.3535233736038208,
        1.0242313146591187,
        1.8296083211898804,
        -1.2847583293914795,
        0.7679618000984192,
        -1.308201551437378,
        0.6470444202423096,
        2.0566556453704834,
        -2.1961467266082764,
        2.3677453994750977,
        1.7248420715332031,
        -0.14485177397727966,
        2.6643314361572266,
        -0.006740869022905827,
        -2.0689897537231445,
        -2.042229652404785,
        0.9303356409072876,
        -1.2824013233184814,
        -0.5558367967605591,
        1.2988159656524658,
        0.841476321220398,
        1.4171977043151855,
        0.4617334306240082,
        -0.0645405575633049,
        0.5400028824806213,
        -0.901611864566803,
        1.1489683389663696,
        -0.9210442900657654,
        -0.6825525760650635,
        -0.5320777893066406,
        -1.0530588626861572,
        0.03583155572414398,
        -0.3883940577507019,
        -0.2717178165912628,
        0.6243001222610474,
        0.7161142826080322,
        -0.3754289150238037,
        0.9444621205329895,
        0.7198079228401184,
        -0.13983404636383057,
        0.6627596616744995,
        -0.23487220704555511,
        0.7159153819084167,
        -0.05887772515416145,
        0.9953464865684509,
        1.1723763942718506,
        0.7684285640716553,
        0.48314473032951355,
        0.28087231516838074,
        -1.023531436920166,
        0.018023746088147163,
        0.7631463408470154,
        2.935751438140869,
        1.138327717781067,
        -1.9396110773086548,
        -0.2547239065170288,
        -1.4115382432937622,
        -0.19396567344665527,
        -2.204111099243164,
        -0.45261210203170776,
        -0.287205308675766,
        3.079554796218872,
        -2.3494582176208496,
        -4.0401105880737305,
        -0.20835773646831512,
        5.057976722717285,
        2.434011459350586,
        2.9702541828155518,
        -5.088976860046387,
        -0.005613182671368122,
        -0.27194175124168396,
        0.4407872259616852,
        1.4112331867218018,
        1.8692140579223633,
        0.9011839032173157,
        1.2926130294799805,
        -0.45508435368537903,
        -0.16024813055992126,
        -1.7216650247573853,
        -0.9952347278594971,
        -1.0663588047027588,
        0.8137466311454773,
        0.5613203048706055,
        -1.101608395576477,
        1.0411359071731567,
        -1.391788125038147,
        0.16533078253269196,
        -1.2717269659042358,
        1.034765362739563,
        -0.6762414574623108,
        -0.9325374364852905,
        0.786820113658905,
        -0.16700372099876404,
        0.9232901930809021,
        1.2822659015655518,
        0.9701328277587891,
        0.09999781101942062,
        -0.14049100875854492,
        -1.4915999174118042,
        -1.2636487483978271,
        -1.0918896198272705,
        1.0912878513336182,
        0.029324116185307503,
        -1.2217512130737305,
        1.6390269994735718,
        -0.6554859280586243,
        2.3763623237609863,
        2.277247190475464,
        0.43154191970825195,
        -1.9634746313095093,
        0.7553002238273621,
        0.0014608673518523574,
        -1.191947340965271,
        -1.42948579788208,
        -1.7045373916625977
      ]
    },
    "onnx::Conv_145": {
      "shape": [
        16
      ],
      "dtype": "float32",
      "data": [
        0.2804538607597351,
        -2.8210432529449463,
        -2.600831985473633,
        -2.871690273284912,
        -1.8919674158096313,
        -3.002305269241333,
        2.951777935028076,
        -3.0069735050201416,
        -2.8380305767059326,
        2.1521642208099365,
        -1.5673179626464844,
        -2.7838876247406006,
        2.6819379329681396,
        -2.767120122909546,
        2.5551459789276123,
        0.30190446972846985
      ]
    },
    "onnx::Conv_147": {
      "shape": [
        32,
        16,
        3,
        3
      ],
      "dtype": "float32",
      "data": [
        -0.127372607588768,
        -0.06750345975160599,
        -0.17287994921207428,
        -0.20731836557388306,
        0.02697082795202732,
        -0.19192413985729218,
        -0.1988506019115448,
        0.038800280541181564,
        0.1568921059370041,
        0.1344597339630127,
        -0.09335841983556747,
        0.11288116127252579,
        0.04793700575828552,
        0.017047645524144173,
        0.10684170573949814,
        0.13161183893680573,
        -0.01723039522767067,
        0.09385641664266586,
        0.0116415498778224,
        -0.06134443357586861,
        0.0799138993024826,
        -0.061642952263355255,
        -0.09321697801351547,
        0.1163351759314537,
        0.16449829936027527,
        0.01834767311811447,
        0.0781937837600708,
        0.029935818165540695,
        -0.018162677064538002,
        0.1998947709798813,
        0.11446336656808853,
        0.17680898308753967,
        -0.07187402248382568,
        0.1254454404115677,
        0.22724519670009613,
        0.040159620344638824,
        0.034018807113170624,
        -0.21856041252613068,
        0.01760217174887657,
        -0.08509117364883423,
        0.15548409521579742,
        0.03969348967075348,
        0.20289842784404755,
        -0.050309259444475174,
        0.031730491667985916,
        0.21761368215084076,
        -0.07950671017169952,
        -0.02388610690832138,
        -0.04227173700928688,
        -0.05072550103068352,
        0.11908325552940369,
        0.008012170903384686,
        0.1811518371105194,
        0.011420865543186665,
        0.0931813195347786,
        0.037237055599689484,
        -0.16413089632987976,
        -0.00822222325950861,
        -0.0839741975069046,
        -0.027208104729652405,
        0.1635579764842987,
        -0.1356167197227478,
        -0.10315151512622833,
        0.03139769658446312,
        0.014261344447731972,
        0.12064667791128159,
        0.24876488745212555,
        0.17761683464050293,
        0.09393324702978134,
        0.199949249625206,
        0.22913998365402222,
        0.07820424437522888,
        -0.052436020225286484,
        -0.09676579385995865,
        0.22976458072662354,
        0.15057654678821564,
        0.2502734959125519,
        -0.057421036064624786,
        0.1798149049282074,
        -0.012016534805297852,
        -0.04635285958647728,
        -0.10087252408266068,
        0.17445765435695648,
        0.16926705837249756,
        -0.11857350915670395,
        -0.12392616271972656,
        0.12669874727725983,
        -0.05217611417174339,
        0.0164480097591877,
        0.05698007717728615,
        -0.2352677881717682,
        -0.008947253227233887,
        -0.03406793996691704,
        -0.21830838918685913,
        -0.2329220324754715,
        0.06724365055561066,
        -0.21998612582683563,
        -0.11062867939472198,
        0.1061578318476677,
        -0.07609670609235764,
        -0.02806183323264122,
        -0.10402737557888031,
        0.14692267775535583,
        0.09668757766485214,
        0.047295063734054565,
        0.09758872538805008,
        0.09438617527484894,
        -0.014204579405486584,
        -0.013155809603631496,
        -0.10701029747724533,
        -0.0937051922082901,
        0.028347760438919067,
        0.008956030011177063,
        0.09266815334558487,
        0.09475430101156235,
        0.16407616436481476,
        0.2072376161813736,
        0.0767156109213829,
        0.1516052931547165,
        -0.09412646293640137,
        0.22320932149887085,
        0.04435703903436661,
        -0.10356950759887695,
        -0.09526175260543823,
        -0.10668525099754333,
        -0.08372707664966583,
        0.09555519372224808,
        -0.14524686336517334,
        -0.01465640775859356,
        0.0027507625054568052,
        0.10402216762304306,
        -0.04363657161593437,
        0.10121601819992065,
        -0.10585424304008484,
        0.15378715097904205,
        -0.258576899766922,
        -0.1639683097600937,
        0.047854430973529816,
        -0.011761615984141827,
        0.0995108112692833,
        0.10138945281505585,
        -0.16698779165744781,
        0.1660923957824707,
        -0.030954012647271156,
        -0.002964554587379098,
        -0.07530488073825836,
        -0.021933214738965034,
        -0.3497023284435272,
        -0.09029445797204971,
        0.13413774967193604,
        -0.053031075745821,
        0.16623499989509583,
        -0.1675664633512497,
        0.241062194108963,
        0.11006524413824081,
        -0.0490095429122448,
        0.2593608498573303,
        0.0010540211806073785,
        -0.07226365059614182,
        -0.0739595890045166,
        -0.11271992325782776,
        0.06762175261974335,
        0.017857002094388008,
        0.17129716277122498,
        0.07657364010810852,
        0.09300847351551056,
        -0.2679433226585388,
        -0.38106676936149597,
        -0.13243013620376587,
        -0.20226873457431793,
        0.08446003496646881,
        0.4379047453403473,
        0.05867308750748634,
        -0.046605464071035385,
        0.0473259761929512,
        0.13944990932941437,
        0.1147744357585907,
        -0.0020035295747220516,
        0.15436360239982605,
        -0.04569796472787857,
        0.41632845997810364,
        0.2849774956703186,
        0.1693050116300583,
        0.14746929705142975,
        -0.056341737508773804,
        -0.06336996704339981,
        -0.10575368255376816,
        0.10676854103803635,
        -0.12315182387828827,
        0.400386244058609,
        0.29197853803634644,
        0.1202397570014,
        0.008777447044849396,
        0.1456681489944458,
        -0.3074440360069275,
        -0.15847152471542358,
        -0.16855840384960175,
        -0.19436144828796387,
        -0.16738662123680115,
        -0.10900745540857315,
        0.17103590071201324,
        -0.06262324005365372,
        -0.19649416208267212,
        0.009362920187413692,
        0.11449433118104935,
        -0.07006076723337173,
        0.3297109007835388,
        -0.055457938462495804,
        0.38314515352249146,
        0.20787020027637482,
        -0.10587272047996521,
        -0.2585689425468445,
        0.08275458216667175,
        -0.10326225310564041,
        0.041288815438747406,
        -0.0022214709315449,
        -0.023531991988420486,
        0.19559793174266815,
        0.053483884781599045,
        -0.1797461360692978,
        0.08666347712278366,
        0.07142538577318192,
        -0.23594272136688232,
        0.19128575921058655,
        -0.0012407053727656603,
        0.15929850935935974,
        -0.200383260846138,
        -0.19967414438724518,
        0.06600899994373322,
        0.1243523433804512,
        -0.2708809971809387,
        0.28288039565086365,
        -0.011117011308670044,
        -0.14231137931346893,
        -0.12548136711120605,
        0.015729917213320732,
        0.1935972422361374,
        -0.19399410486221313,
        0.25629547238349915,
        0.2506444454193115,
        0.12574821710586548,
        0.12857353687286377,
        -0.17977258563041687,
        0.12890994548797607,
        0.42135876417160034,
        0.10905340313911438,
        -0.014231923967599869,
        0.2144119143486023,
        -0.3337453603744507,
        -0.14107581973075867,
        -0.20904755592346191,
        -0.1617162525653839,
        -0.015293939970433712,
        -0.06314314156770706,
        0.2990994155406952,
        0.040684785693883896,
        -0.23686134815216064,
        0.2458193302154541,
        -0.08269277215003967,
        0.05097996070981026,
        0.07681463658809662,
        -0.06897016614675522,
        0.23759137094020844,
        -0.08475582301616669,
        -0.2589857280254364,
        0.24597837030887604,
        0.0970688909292221,
        -0.1967533677816391,
        -0.2591787874698639,
        0.11434683948755264,
        0.1057000607252121,
        -0.16089104115962982,
        -0.1905895173549652,
        -0.12653948366641998,
        -0.13648621737957,
        0.05173167213797569,
        0.03683198615908623,
        -0.2502216398715973,
        0.1956959366798401,
        0.2706826627254486,
        -0.05824793875217438,
        0.3767300546169281,
        -0.15454761683940887,
        0.0935516431927681,
        0.2664076089859009,
        0.17953172326087952,
        0.23469914495944977,
        0.09125658869743347,
        0.07495732605457306,
        -0.14360928535461426,
        -0.13119861483573914,
        0.1349172294139862,
        -0.19403405487537384,
        0.037547703832387924,
        -0.12036745250225067,
        0.09779279679059982,
        0.06701541692018509,
        -0.027468610554933548,
        -0.00976814515888691,
        -0.10431967675685883,
        0.1745896190404892,
        -0.08474558591842651,
        0.08530387282371521,
        0.13052374124526978,
        -0.14004622399806976,
        -0.14464092254638672,
        -0.09579440206289291,
        0.01438333373516798,
        0.14021435379981995,
        -0.019142093136906624,
        -0.04251173511147499,
        0.14245302975177765,
        0.16093985736370087,
        0.13160279393196106,
        0.17265407741069794,
        -0.16121616959571838,
        -0.1561128795146942,
        0.03524176403880119,
        -0.13639235496520996,
        -0.02922106720507145,
        0.12689760327339172,
        0.17681601643562317,
        -0.01841302588582039,
        -0.10649304836988449,
        -0.10387532413005829,
        0.16288934648036957,
        -0.04932398349046707,
        -0.20895902812480927,
        -0.14386926591396332,
        -0.1415001004934311,
        -0.09556210041046143,
        -0.16904175281524658,
        -0.10211028903722763,
        0.13724994659423828,
        -0.09913170337677002,
        -0.02892112545669079,
        0.1008714810013771,
        -0.1413438767194748,
        -0.06546422094106674,
        -0.027454212307929993,
        0.12942743301391602,
        0.04575613886117935,
        0.018705714493989944,
        -0.06689145416021347,
        0.0713631808757782,
        -0.0941566452383995,
        -0.07273056358098984,
        -0.10094880312681198,
        0.047265954315662384,
        0.13323557376861572,
        -0.14499133825302124,
        -0.023761946707963943,
        -0.022755704820156097,
        -0.07477761805057526,
        -0.12204423546791077,
        -0.06036018580198288,
        -0.11298026889562607,
        0.12236753851175308,
        -0.11414187401533127,
        0.11876081675291061,
        0.12285960465669632,
        -0.049583982676267624,
        0.15485753118991852,
        0.12664856016635895,
        -0.10863683372735977,
        0.11036314815282822,
        0.05067462474107742,
        0.1436299830675125,
        -0.10727284103631973,
        0.11997456103563309,
        0.004330178257077932,
        0.06996189057826996,
        -0.13489490747451782,
        0.06225195154547691,
        -0.05104810371994972,
        0.08316648006439209,
        -0.035849012434482574,
        0.0644928365945816,
        -0.14483898878097534,
        -0.17063167691230774,
        0.09356701374053955,
        0.06663008034229279,
        0.04853566735982895,
        0.053237367421388626,
        0.07145914435386658,
        -0.10405471920967102,
        0.09861983358860016,
        0.053646255284547806,
        -0.09378954023122787,
        -0.10640018433332443,
        -0.19821462035179138,
        0.08227303624153137,
        -0.017290158197283745,
        0.00671759620308876,
        -0.14209067821502686,
        -0.14015333354473114,
        0.16262122988700867,
        0.11153998225927353,
        0.08007537573575974,
        0.11194662004709244,
        0.09458858519792557,
        0.06694429367780685,
        0.09315095841884613,
        -0.05948416888713837,
        0.0161301176995039,
        -0.15334215760231018,
        -0.07146279513835907,
        -0.00543544115498662,
        -0.00581532483920455,
        0.1727176457643509,
        0.15178796648979187,
        0.04074721410870552,
        0.15407522022724152,
        -0.06444225460290909,
        0.05975254997611046,
        -0.14369691908359528,
        -0.14763778448104858,
        0.08187120407819748,
        0.01617497205734253,
        -0.03334260359406471,
        -0.10271456837654114,
        0.09157899022102356,
        -0.02196260169148445,
        0.10198812186717987,
        -0.13492609560489655,
        0.11273344606161118,
        -0.05705235153436661,
        -0.12792746722698212,
        -0.06799884140491486,
        -0.2128376066684723,
        -0.10638722777366638,
        -0.056553687900304794,
        -0.16703686118125916,
        0.12310473620891571,
        0.18517374992370605,
        0.08218774944543839,
        -0.14269936084747314,
        -0.14253760874271393,
        -0.2085217982530594,
        -0.15335869789123535,
        0.10589978843927383,
        0.0773022323846817,
        -0.10115019232034683,
        0.04134007543325424,
        -0.05171123519539833,
        0.004099465906620026,
        -0.18084865808486938,
        0.2078557163476944,
        -0.04134108126163483,
        -0.13417428731918335,
        -0.023259444162249565,
        0.06291288882493973,
        0.1385003924369812,
        -0.11856361478567123,
        -0.010492571629583836,
        -0.12630265951156616,
        -0.1322481483221054,
        -0.09634040296077728,
        -0.07035378366708755,
        0.11915542930364609,
        -0.2102798968553543,
        -0.011293761432170868,
        -0.11169388145208359,
        0.1295376420021057,
        0.024593882262706757,
        -0.12175074964761734,
        0.20338153839111328,
        -0.11008192598819733,
        -0.09545381367206573,
        -0.21273940801620483,
        0.023969873785972595,
        0.03361750766634941,
        0.1637086123228073,
        -0.14859960973262787,
        -0.15452617406845093,
        0.23550371825695038,
        0.07473349571228027,
        -0.19389694929122925,
        0.05492255091667175,
        0.22885353863239288,
        0.008762596175074577,
        -0.09644412249326706,
        -0.08497290313243866,
        -0.07597517967224121,
        0.12738355994224548,
        -0.10910934954881668,
        0.18436199426651,
        -0.1641930788755417,
        0.03469827026128769,
        0.17670805752277374,
        -0.14961858093738556,
        -0.2009877860546112,
        -0.16524095833301544,
        -0.15100425481796265,
        -0.21293587982654572,
        -0.2544728219509125,
        -0.1412547528743744,
        -0.057535506784915924,
        0.17390568554401398,
        -0.050118543207645416,
        0.060588233172893524,
        -0.07502076774835587,
        0.04770148918032646,
        0.15201899409294128,
        0.0042058490216732025,
        -0.05232007056474686,
        0.04239671677350998,
        0.17749714851379395,
        -0.1730726808309555,
        0.23809275031089783,
        -0.048361968249082565,
        0.16550879180431366,
        0.21632495522499084,
        0.015989279374480247,
        -0.0050608026795089245,
        0.1272466778755188,
        -0.07780804485082626,
        0.0029664947651326656,
        0.1880946159362793,
        -0.10960165411233902,
        -0.1549585908651352,
        0.09284379333257675,
        0.15789943933486938,
        0.17937278747558594,
        -0.19542653858661652,
        0.15458406507968903,
        0.11734164506196976,
        -0.11434221267700195,
        0.13744033873081207,
        -0.08224142342805862,
        0.16498443484306335,
        -0.003579334821552038,
        0.0471295528113842,
        -0.10074736922979355,
        -0.08140324056148529,
        -0.14672687649726868,
        0.1376672238111496,
        -0.18091075122356415,
        0.030158281326293945,
        0.1287212073802948,
        -0.026363423094153404,
        -0.08806922286748886,
        0.0205845944583416,
        -0.013970336876809597,
        -0.15571360290050507,
        -0.07559502869844437,
        -0.09827711433172226,
        -0.17875486612319946,
        -0.06757371872663498,
        -0.12467143684625626,
        -0.1727118045091629,
        -0.1619216352701187,
        -0.1501503437757492,
        -0.04433238506317139,
        0.21532092988491058,
        -0.01963139697909355,
        -0.09612385928630829,
        -0.1246609315276146,
        -0.00268101436085999,
        0.14802949130535126,
        -0.2387867122888565,
        0.1587803065776825,
        0.18422311544418335,
        0.030453871935606003,
        0.06897105276584625,
        0.011077076196670532,
        -0.2778705060482025,
        -0.11339500546455383,
        -0.08525804430246353,
        -0.16301116347312927,
        -0.05333185940980911,
        -0.002488446421921253,
        -0.002666729036718607,
        0.056363243609666824,
        -0.17989523708820343,
        0.14268045127391815,
        -0.03239855915307999,
        0.11920750886201859,
        0.12658675014972687,
        -0.163786843419075,
        -0.19360865652561188,
        0.09027986973524094,
        0.12724769115447998,
        -0.012578686699271202,
        0.027189331129193306,
        0.011387213133275509,
        -0.07435084134340286,
        0.03653432056307793,
        0.07189228385686874,
        -0.14719592034816742,
        -0.07672851532697678,
        -0.07854366302490234,
        0.07756226509809494,
        -0.1777287870645523,
        -0.16482199728488922,
        -0.17777320742607117,
        -0.11837255954742432,
        -0.11728255450725555,
        -0.012996170669794083,
        -0.1355331987142563,
        0.10175172239542007,
        0.1376631259918213,
        0.03323543071746826,
        -0.05100094899535179,
        0.04841750115156174,
        -0.17435620725154877,
        -0.07880225777626038,
        -0.042641185224056244,
        -0.19310645759105682,
        0.20445334911346436,
        0.13295362889766693,
        0.0677676573395729,
        0.11087053269147873,
        0.14772997796535492,
        -0.07878585159778595,
        0.013601697981357574,
        -0.08034130185842514,
        -0.06345115602016449,
        -0.10723460465669632,
        0.11094778031110764,
        -0.10979533940553665,
        -0.06234109774231911,
        0.14039304852485657,
        -0.13211119174957275,
        0.06937907636165619,
        -0.11514212936162949,
        -0.10395652055740356,
        0.17886793613433838,
        0.10928085446357727,
        -0.01130584441125393,
        -0.09436752647161484,
        0.1158989667892456,
        0.15654423832893372,
        0.01710372418165207,
        -0.12307562679052353,
        -0.0063543785363435745,
        0.06625889986753464,
        0.03168833628296852,
        0.13294772803783417,
        0.16164731979370117,
        0.07772450149059296,
        -0.15995334088802338,
        0.027857055887579918,
        0.05375565588474274,
        -0.08201823383569717,
        0.09090837091207504,
        0.1304144263267517,
        -0.1064060777425766,
        -0.021812360733747482,
        -0.10762522369623184,
        -0.019503669813275337,
        0.09989167749881744,
        0.15158772468566895,
        -0.04135214164853096,
        0.14268185198307037,
        -0.12072376161813736,
        -0.0168235395103693,
        -0.026049621403217316,
        -0.06965004652738571,
        0.1496203988790512,
        0.07168425619602203,
        -0.15760578215122223,
        -0.15818174183368683,
        -0.07225527614355087,
        0.0563419833779335,
        0.07711799442768097,
        0.10114720463752747,
        0.13165070116519928,
        -0.10713951289653778,
        0.02963493950664997,
        -0.061112578958272934,
        -0.05745174363255501,
        0.04513636603951454,
        0.021154919639229774,
        -0.11395162343978882,
        0.030932730063796043,
        0.07915136963129044,
        0.12048538029193878,
        -0.05485581234097481,
        0.09082158654928207,
        -0.09033531695604324,
        -0.08372323960065842,
        0.1629369705915451,
        -0.029352610930800438,
        -0.05562225729227066,
        -0.041308823972940445,
        0.1466047614812851,
        -0.09502970427274704,
        -0.06939849257469177,
        -0.010036548599600792,
        -0.11993333697319031,
        0.05341460928320885,
        0.1281052678823471,
        0.06635303050279617,
        -0.03708686679601669,
        -0.06912362575531006,
        -0.10344786196947098,
        -0.09331674873828888,
        -0.05140744149684906,
        0.12151794135570526,
        0.16493134200572968,
        -0.035660520195961,
        -0.026018353179097176,
        0.11184800416231155,
        -0.030069205909967422,
        -0.1249578446149826,
        0.08158794790506363,
        -0.06743574142456055,
        -0.13584579527378082,
        -0.014551221393048763,
        -0.12408597022294998,
        -0.07198680937290192,
        -0.06627070158720016,
        -0.011122266761958599,
        0.02546013705432415,
        -0.09948332607746124,
        -0.18703565001487732,
        -0.039425093680620193,
        0.15987791121006012,
        -0.033135998994112015,
        -0.16214165091514587,
        -0.08553910255432129,
        0.21973101794719696,
        -0.010205376893281937,
        -0.07084597647190094,
        0.20169375836849213,
        0.003144857008010149,
        -0.01847558468580246,
        0.22920221090316772,
        -0.007349736988544464,
        -0.0440828800201416,
        0.18598563969135284,
        0.07854324579238892,
        -0.15091946721076965,
        0.13794800639152527,
        -0.06111077219247818,
        -0.19435758888721466,
        0.19397324323654175,
        -0.16549061238765717,
        -0.06679028272628784,
        -0.010918175801634789,
        0.023215876892209053,
        -0.0025566124822944403,
        0.18589381873607635,
        0.20202872157096863,
        -0.2184557169675827,
        -0.17235702276229858,
        -0.19872386753559113,
        0.16888411343097687,
        -0.024945128709077835,
        -0.11278337240219116,
        -0.16461831331253052,
        0.01572261191904545,
        0.0958632081747055,
        0.15366633236408234,
        0.17906589806079865,
        0.21959304809570312,
        -0.10255273431539536,
        0.025100717321038246,
        -0.19355164468288422,
        -0.1131862998008728,
        -0.029903657734394073,
        0.1337578147649765,
        -0.10018481314182281,
        -0.15074490010738373,
        -0.07055944204330444,
        0.04850617051124573,
        -0.0033647380769252777,
        0.15053880214691162,
        -0.2219529151916504,
        0.07066519558429718,
        0.19774197041988373,
        0.13061122596263885,
        -0.1968161016702652,
        -0.1478380709886551,
        -0.016122696921229362,
        -0.06666789948940277,
        0.15158522129058838,
        0.1857757270336151,
        -0.034383438527584076,
        -0.056809354573488235,
        0.12402764707803726,
        -0.1585153341293335,
        -0.09707516431808472,
        0.004288371652364731,
        -0.033915214240550995,
        0.1342724710702896,
        -0.06708971410989761,
        0.02566274255514145,
        0.07810133695602417,
        -0.021213725209236145,
        -0.07302329689264297,
        0.13479971885681152,
        0.10298975557088852,
        -0.021389057859778404,
        -0.16524265706539154,
        -0.11305174231529236,
        0.14605554938316345,
        0.14524643123149872,
        -0.09326387941837311,
        0.1369425505399704,
        -0.011575121432542801,
        -0.012714715674519539,
        -0.15616312623023987,
        0.0009663428645581007,
        -0.056371428072452545,
        0.015215517021715641,
        -0.20253758132457733,
        0.00034732199856080115,
        -0.1904844045639038,
        -0.2243395298719406,
        -0.269674152135849,
        -0.10419739782810211,
        0.00019109428103547543,
        -0.0013906023232266307,
        0.011849875561892986,
        -0.051715265959501266,
        -0.1331019550561905,
        -0.07809730619192123,
        -0.1647130250930786,
        -0.0371723510324955,
        0.06048477068543434,
        0.00013071627472527325,
        -0.23222555220127106,
        0.18493691086769104,
        0.20550070703029633,
        -0.1194462925195694,
        -0.20903503894805908,
        0.02360260672867298,
        0.03552449122071266,
        -0.10221222043037415,
        -0.1070375069975853,
        0.010824236087501049,
        -0.1777176707983017,
        -0.11075426638126373,
        0.07423274964094162,
        0.01240419689565897,
        0.08997504413127899,
        0.1574292629957199,
        -0.00843044463545084,
        0.08583521097898483,
        0.15158119797706604,
        -0.1376783549785614,
        0.1726405918598175,
        0.14293143153190613,
        -0.09522836655378342,
        0.1461808830499649,
        -0.15248757600784302,
        -0.16502705216407776,
        0.17188198864459991,
        0.10795427858829498,
        -0.03813321888446808,
        -0.15617413818836212,
        0.11657290160655975,
        0.051166143268346786,
        -0.11898751556873322,
        0.0033197146840393543,
        0.15349873900413513,
        0.03983936086297035,
        -0.14745604991912842,
        -0.03842725604772568,
        -0.09956221282482147,
        0.11726999282836914,
        0.08160363882780075,
        -0.03311514854431152,
        0.015952112153172493,
        -0.13374534249305725,
        -0.00724155455827713,
        0.1451539546251297,
        -0.1403837949037552,
        0.02552320994436741,
        0.1933678835630417,
        0.08361893892288208,
        0.09090676158666611,
        -0.03424723818898201,
        -0.00455338042229414,
        -0.14384204149246216,
        -0.08378807455301285,
        0.04557076096534729,
        0.047568924725055695,
        0.09703637659549713,
        -0.08953111618757248,
        0.0519900880753994,
        -0.09881433099508286,
        -0.1252911388874054,
        -0.06445593386888504,
        -0.11118042469024658,
        0.04000724479556084,
        0.02385299652814865,
        0.11701799184083939,
        0.08537832647562027,
        0.054699864238500595,
        0.10773538053035736,
        0.07881789654493332,
        -0.15287721157073975,
        -0.06457652151584625,
        -0.13631871342658997,
        -0.10455233603715897,
        0.036460574716329575,
        0.15359213948249817,
        0.11542002856731415,
        -0.04081672802567482,
        0.05449124798178673,
        0.15003478527069092,
        0.07180646061897278,
        -0.11177299171686172,
        0.02032831497490406,
        0.07337063550949097,
        0.0363808311522007,
        0.16051751375198364,
        0.1605004072189331,
        -0.08505156636238098,
        0.12031742930412292,
        -0.15162980556488037,
        -0.097050741314888,
        0.06008199229836464,
        0.010348294861614704,
        0.14246982336044312,
        0.08610938489437103,
        -0.030322691425681114,
        0.1538711041212082,
        -0.1050620749592781,
        0.0632607638835907,
        0.07014987617731094,
        0.14189432561397552,
        0.18510346114635468,
        0.08090319484472275,
        -0.05183085426688194,
        0.16474658250808716,
        0.13277581334114075,
        0.0016577962087467313,
        0.13441510498523712,
        0.03385742008686066,
        -0.012673375196754932,
        0.05998871102929115,
        -0.0020862151868641376,
        -0.012114666402339935,
        0.05871139094233513,
        0.028213737532496452,
        -0.10868581384420395,
        -0.10866126418113708,
        0.06290263682603836,
        -0.06228610500693321,
        0.014259278774261475,
        0.15277571976184845,
        0.12697553634643555,
        0.11536650359630585,
        0.08924666047096252,
        0.11814301460981369,
        -0.08152930438518524,
        0.17659351229667664,
        -0.10959456861019135,
        -0.0952928364276886,
        -0.062186092138290405,
        0.15974612534046173,
        0.11720418930053711,
        0.04832812026143074,
        0.0651836171746254,
        -0.16884954273700714,
        -0.18213088810443878,
        0.026944030076265335,
        -0.022134579718112946,
        0.06122373789548874,
        -0.08440013229846954,
        0.20070567727088928,
        -0.11348273605108261,
        0.12823930382728577,
        0.12849313020706177,
        -0.06101318076252937,
        0.15548262000083923,
        0.09567634761333466,
        -0.07051288336515427,
        -0.07337982207536697,
        0.14754168689250946,
        -0.036746520549058914,
        0.028943369165062904,
        0.10331123322248459,
        0.09205601364374161,
        -0.06549787521362305,
        0.17093606293201447,
        0.06692627817392349,
        0.044804416596889496,
        -0.06426410377025604,
        0.07233602553606033,
        -0.03475683927536011,
        0.12385973334312439,
        0.07766857743263245,
        0.11758982390165329,
        -0.013326119631528854,
        0.11265479773283005,
        0.11204710602760315,
        0.057104405015707016,
        -0.02196751907467842,
        -0.11164650321006775,
        -0.05466674640774727,
        0.1024567037820816,
        -0.09328194707632065,
        -0.05117768794298172,
        0.09161671251058578,
        -0.10897906124591827,
